In [1]:
i=7700
str(i).count('7') #7700-> "7700" -> count('7') ->2

2

In [11]:
user_input = input().split(',')

In [8]:
def name (lst) :
    count = 0
    for i in lst :
        if '김' in i or '이' in i :
            count += 1
    print(count)

name(user_input)

8

In [12]:
'김' in "홍김동"

True

In [ ]:
user_input = input().split(',')
def name (lst) :
    count = 0
    for i in lst :
        if '이재영' in i :
            count += 1
    print(count)

name(user_input)

In [ ]:
str(list(range(1,100001))).count('7')

In [ ]:
1~100000 까지 7이 몇개인가?
00001
~
99999

In [16]:
"김개똥".startswith('김가')

False

In [19]:
import numpy as np

In [20]:
a=[10,20,5,1]

In [22]:
import numpy as np
a=[10,20,5,1]
np.argmax(a)
np.argmin(a)

3

In [25]:
sum(a)

36

In [ ]:
sum(str(x).count('7')for x in range(1,100001))

In [26]:
sum([str(x).count('7') for x in range(1,100001)])

50000

In [28]:
import numpy as np
import pandas as pd

In [30]:
name=["이유덕","이재영","권종표","이재영","박민호","강상희","이재영","김지완","최승혁","이성연","박영서","박민호","전경헌","송정환","김재성","이유덕","전경헌"]
df=pd.DataFrame({'이름':name})
name1=df['이름'].apply(lambda x:x[0])
name1

0     이
1     이
2     권
3     이
4     박
5     강
6     이
7     김
8     최
9     이
10    박
11    박
12    전
13    송
14    김
15    이
16    전
Name: 이름, dtype: object

In [ ]:
name1[name1.isin(['이','김'])].value_counts()

In [ ]:
#csv, json, xlsx, html, xml, hdf5, sas, sql

In [31]:
%%writefile sample1.csv
c1, c2, c3
1, 1.1, one
2, 2.2, two
3, 3.3, three

Writing sample1.csv

In [32]:
import pandas as pd
import numpy as np

In [34]:
pd.read_csv("sample1.csv")

   c1   c2      c3
0   1  1.1     one
1   2  2.2     two
2   3  3.3   three

In [35]:
%%writefile sample2.csv
1, 1.1, one
2, 2.2, two
3, 3.3, three

Writing sample2.csv

In [36]:
pd.read_csv("sample2.csv")

   1   1.1     one
0  2   2.2     two
1  3   3.3   three

In [37]:
pd.read_csv("sample2.csv", names=['c1','c2','c3'])

   c1   c2      c3
0   1  1.1     one
1   2  2.2     two
2   3  3.3   three

In [38]:
pd.read_csv("sample1.csv")

   c1   c2      c3
0   1  1.1     one
1   2  2.2     two
2   3  3.3   three

In [42]:
pd.read_csv("sample1.csv", index_col='c1')

     c2      c3
c1
1   1.1     one
2   2.2     two
3   3.3   three

In [43]:
%%writefile sample3.txt
c1        c2        c3        c4
0.179181 -1.538472  1.347553  0.43381
1.024209  0.087307 -1.281997  0.49265
0.417899 -2.002308  0.255245 -1.10515

Writing sample3.txt

In [49]:
df=pd.read_csv("sample3.txt", sep="\s+")
df

         c1        c2        c3       c4
0  0.179181 -1.538472  1.347553  0.43381
1  1.024209  0.087307 -1.281997  0.49265
2  0.417899 -2.002308  0.255245 -1.10515

In [50]:
df.shape

(3, 4)

In [51]:
df=pd.read_table("sample3.txt", sep="\s+")
df

         c1        c2        c3       c4
0  0.179181 -1.538472  1.347553  0.43381
1  1.024209  0.087307 -1.281997  0.49265
2  0.417899 -2.002308  0.255245 -1.10515

In [52]:
%%writefile sample4.txt
파일 제목: sample4.txt
데이터 포맷의 설명:
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Writing sample4.txt

In [54]:
df=pd.read_csv("sample4.txt", skiprows=[0,1])
df

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [56]:
df=pd.read_csv("sample4.txt", skiprows=[0,1,2])
df

   1   1.11     one
0  2   2.22     two
1  3   3.33   three

In [73]:
%%writefile sample5.csv
c1, c2, c3
1, , one
2,모름, two
누락, 3.33, three

Overwriting sample5.csv

In [74]:
#df=pd.read_csv("sample5.csv")
#df

df=pd.read_csv("sample5.csv", na_values=["누락","모름", " "])

In [75]:
df

    c1    c2      c3
0  1.0   NaN     one
1  2.0   NaN     two
2  NaN  3.33   three

In [76]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   c1      2 non-null      float64
 1    c2     1 non-null      float64
 2    c3     3 non-null      object
dtypes: float64(2), object(1)
memory usage: 204.0+ bytes

In [77]:
df

    c1    c2      c3
0  1.0   NaN     one
1  2.0   NaN     two
2  NaN  3.33   three

In [80]:
df.to_csv("sample6.csv", index=False)

In [81]:
df.to_csv("sample7.csv", sep="@")

In [82]:
df

    c1    c2      c3
0  1.0   NaN     one
1  2.0   NaN     two
2  NaN  3.33   three

In [83]:
df.to_csv("sample8.csv", index=False, na_rep="자료없음")

In [85]:
df
df.index

RangeIndex(start=0, stop=3, step=1)

In [86]:
df.columns

Index(['c1', ' c2', ' c3'], dtype='object')

In [87]:
df.index=['a','b','c']
df

    c1    c2      c3
a  1.0   NaN     one
b  2.0   NaN     two
c  NaN  3.33   three

In [88]:
df.columns=['x','y','z']
df

     x     y       z
a  1.0   NaN     one
b  2.0   NaN     two
c  NaN  3.33   three

In [89]:
df.to_csv("sample9.csv", index=False, header=False)

In [90]:
df=pd.read_csv("https://github.com/datablist/sample-csv-files/blob/main/files/people/people-100.csv")
df

ParserError: Error tokenizing data. C error: Expected 1 fields in line 33, saw 8

In [91]:
df = pd.read_csv("https://raw.githubusercontent.com/datascienceschool/docker_rpython/master/data/titanic.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [95]:
pd.read_csv("ex1.csv")
pd.read_csv("ex2.csv", header=None, names=['a','b','c','d','msg'])

   a   b   c   d    msg
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [96]:
pd.read_csv("ex2.csv", header=None, names=['a','b','c','d','msg'], index_col='msg')

       a   b   c   d
msg
hello  1   2   3   4
world  5   6   7   8
foo    9  10  11  12

In [99]:
pd.read_csv("csv_mindex.csv")

  key1 key2  value1  value2
0  one    a       1       2
1  one    b       3       4
2  one    c       5       6
3  one    d       7       8
4  two    a       9      10
5  two    b      11      12
6  two    c      13      14
7  two    d      15      16

In [102]:
pd.read_csv("csv_mindex.csv", index_col=["key2","key1"])
pd.read_csv("csv_mindex.csv", index_col=["key1","key2"])

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [105]:
pd.read_csv("ex3.txt",sep="\s+")

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [107]:
pd.read_csv("ex4.csv", skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [122]:
df=pd.read_csv("ex5.csv")
df

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [121]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   something  3 non-null      object
 1   a          3 non-null      int64
 2   b          3 non-null      int64
 3   c          2 non-null      float64
 4   d          3 non-null      int64
 5   message    2 non-null      object
dtypes: float64(1), int64(3), object(2)
memory usage: 276.0+ bytes

In [123]:
df.isnull()

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [124]:
df

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [ ]:
# csv에 저장된 NaN, NA, '' 데이터 값들은
# read_csv로 읽었을 경우, 자동으로 NaN(결측값)으로 인식됨
# '누락', '없음',... =>  na_values=["누락","없음", " "]와 같은 방식으로 처리

In [1]:
obj = """
{"name": "Wes",
 "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]},
              {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]
}
"""

In [ ]:
'hello'
"hello"
"""
hi
hello
"""

In [2]:
import json

In [4]:
res=json.loads(obj)
res

{'name': 'Wes',
 'cities_lived': ['Akron', 'Nashville', 'New York', 'San Francisco'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 34, 'hobbies': ['guitars', 'soccer']},
  {'name': 'Katie', 'age': 42, 'hobbies': ['diving', 'art']}]}

In [5]:
type(res)

dict

In [7]:
asjson=json.dumps(res)
asjson

'{"name": "Wes", "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"], "pet": null, "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]}, {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]}'

In [10]:
import pandas as pd

In [11]:
pd.DataFrame(res['siblings'])

    name  age            hobbies
0  Scott   34  [guitars, soccer]
1  Katie   42      [diving, art]

In [12]:
res

{'name': 'Wes',
 'cities_lived': ['Akron', 'Nashville', 'New York', 'San Francisco'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 34, 'hobbies': ['guitars', 'soccer']},
  {'name': 'Katie', 'age': 42, 'hobbies': ['diving', 'art']}]}

In [13]:
pd.read_json("example.json")

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [17]:
import pandas as pd
#from pandas import Series as ser

In [ ]:
#pd.Series()

In [18]:
#Series([10,20,30])
#ser([10,20,30])

0    10
1    20
2    30
dtype: int64

In [22]:
data = [100, 200, 300]
index = ["철수", "영희", "아름"]
s = Series(index, data)
print(s)

100    철수
200    영희
300    아름
dtype: object

In [20]:
score = [100, 200, 300]
name = ["철수", "영희", "아름"]

In [21]:
Series(data=score, index=name)

철수    100
영희    200
아름    300
dtype: int64

In [25]:
data = [100, 200, 300]
index = ["철수", "영희", "아름"]
s = Series(data)
s

0    100
1    200
2    300
dtype: int64

In [23]:

s.index = index
print(s)

철수    100
영희    200
아름    300
dtype: int64

In [26]:
score = {
    "철수": 100,
    "영희": 200,
    "아름": 300
}

s = Series(score)

In [27]:
s

철수    100
영희    200
아름    300
dtype: int64

In [28]:
data = [100, 200, 300]
index = ["철수", "영희", "아름"]
s = Series(data, index)
s

철수    100
영희    200
아름    300
dtype: int64

In [29]:
s.index

Index(['철수', '영희', '아름'], dtype='object')

In [30]:
s.values

array([100, 200, 300], dtype=int64)

In [31]:
s

철수    100
영희    200
아름    300
dtype: int64

In [32]:
s.to_dict()

{'철수': 100, '영희': 200, '아름': 300}

In [33]:
s.to_excel("mydata.xlsx")

In [35]:
s.to_excel("mydata.xlsx", header=False)

In [39]:
pd.read_excel("mydata.xlsx", header=None)

    0    1
0  철수  100
1  영희  200
2  아름  300

In [40]:
data = [100, 200, 300]
index = ["철수", "영희", "아름"]
s = Series(data, index)
s

철수    100
영희    200
아름    300
dtype: int64

In [41]:
s.dtype

dtype('int64')

In [42]:
type(s)

pandas.core.series.Series

In [43]:
data = [  10,  "가" ]
s = Series( data )

In [44]:
s

0    10
1     가
dtype: object

In [45]:
data = [100, 200, 300]
index = ["철수", "영희", "아름"]
s = Series(data, index)

In [46]:
s

철수    100
영희    200
아름    300
dtype: int64

In [48]:
s.index.dtype

dtype('O')

In [49]:
import pandas as pd

data = {"apple": 1500, "banana": 3000}
s = pd.Series(data)
s

apple     1500
banana    3000
dtype: int64

In [50]:
s.to_dict()

{'apple': 1500, 'banana': 3000}

In [51]:
s = pd.Series(['1', '2', '3'])
s

0    1
1    2
2    3
dtype: object

In [62]:
#s[0]+10
#s+10

#int(s[0])+10

s.astype('float64')

0    1.0
1    2.0
2    3.0
dtype: float64

In [72]:
data = [100, 200, 300]
index = ["철수", "영희", "아름"]
s = Series(data, index)
s

철수    100
영희    200
아름    300
dtype: int64

In [ ]:
#영수 400

In [64]:
s["영수"] = 400

In [65]:
s

철수    100
영희    200
아름    300
영수    400
dtype: int64

In [66]:
#s 에서 철수 제거

In [67]:
del s["철수"]
s

영희    200
아름    300
영수    400
dtype: int64

In [70]:
s=s.drop("영수")

In [71]:
s

영희    200
아름    300
dtype: int64

In [73]:
s

철수    100
영희    200
아름    300
dtype: int64

In [75]:
s=s.iloc[1:]
s

영희    200
아름    300
dtype: int64

In [76]:
s = pd.Series(
    data = [9000, 9000, 8000, 9000, 10000],
    index = ['김과장', '이대리', '박전무', '이대리', '이대리']
)
s

김과장     9000
이대리     9000
박전무     8000
이대리     9000
이대리    10000
dtype: int64

In [77]:
s.unique()

array([ 9000,  8000, 10000], dtype=int64)

In [80]:
s.index.unique()

Index(['김과장', '이대리', '박전무'], dtype='object')

In [81]:
s = pd.Series(
    data = [9000, 9000, 8000, 9000, 10000],
    index = ['김과장', '이대리', '박전무', '이대리', '이대리']
)
s

김과장     9000
이대리     9000
박전무     8000
이대리     9000
이대리    10000
dtype: int64

In [82]:
s.value_counts()

9000     3
8000     1
10000    1
dtype: int64

In [83]:
s.index.value_counts()

이대리    3
김과장    1
박전무    1
dtype: int64

In [84]:
data = {
    "삼성전자": "전기,전자",
    "LG전자": "전기,전자",
    "현대차": "운수장비",
    "NAVER": "서비스업",
    "카카오": "서비스업"
}
s = Series(data)

In [85]:
s

삼성전자     전기,전자
LG전자     전기,전자
현대차       운수장비
NAVER     서비스업
카카오       서비스업
dtype: object

In [86]:
s.value_counts()

전기,전자    2
서비스업     2
운수장비     1
dtype: int64

In [87]:
data = [100, 300, 200]
index = ["08/01", "08/02", "08/03"]
s = Series(data, index)
s

08/01    100
08/02    300
08/03    200
dtype: int64

In [90]:
s.iloc[[0,2,1]]

08/01    100
08/03    200
08/02    300
dtype: int64

In [91]:
import numpy as np

data = np.random.randint(10, size=4)
s = Series(data)

In [92]:
s

0    3
1    4
2    4
3    9
dtype: int32

In [93]:
s.sort_values()

0    3
1    4
2    4
3    9
dtype: int32

In [94]:
s.sort_values(ascending=False)

3    9
1    4
2    4
0    3
dtype: int32

In [95]:
s.sort_index()

0    3
1    4
2    4
3    9
dtype: int32

In [96]:
data = [100, 300, 200]
s = Series(data)
s

0    100
1    300
2    200
dtype: int64

In [97]:
s+100

0    200
1    400
2    300
dtype: int64

In [102]:
high = Series(data=[51500, 51200, 52500], index=["5/3", "5/2", "5/1"])
low = Series(data=[50700, 50500, 50500], index=["5/1", "5/2", "5/4"])

In [103]:
high

5/3    51500
5/2    51200
5/1    52500
dtype: int64

In [104]:
low

5/1    50700
5/2    50500
5/4    50500
dtype: int64

In [105]:
high-low

5/1    1800.0
5/2     700.0
5/3       NaN
5/4       NaN
dtype: float64

In [106]:
s = Series(data=[51500, 51200, 52500], index=["5/1", "5/2", "5/3"])
s

5/1    51500
5/2    51200
5/3    52500
dtype: int64

In [107]:
s>=51700

5/1    False
5/2    False
5/3     True
dtype: bool

In [108]:
s[s>=51700]

5/3    52500
dtype: int64

In [110]:
s[(s>=51300) & (s<=53000)]

5/1    51500
5/3    52500
dtype: int64

In [112]:
s

5/1    51500
5/2    51200
5/3    52500
dtype: int64

In [113]:
sum((s>=51300) & (s<=53000))

2

In [114]:
s[(s>=51300) & (s<=53000)]

5/1     True
5/2    False
5/3     True
dtype: bool

In [116]:
len(s[(s>=51300) & (s<=53000)])

2

In [117]:
from pandas import Series 

data = {
    "2020-12-11": 73400,
    "2020-12-10": 72900,
    "2020-12-09": 73900,
    "2020-12-08": 71700,
    "2020-12-07": 72900
}

s = Series(data)
s

2020-12-11    73400
2020-12-10    72900
2020-12-09    73900
2020-12-08    71700
2020-12-07    72900
dtype: int64

In [118]:
s.sum()

364800

In [119]:
s.mean()

72960.0

In [120]:
s.product()

-6514723640420366336

In [126]:
s=s.astype('float32')
s

2020-12-11    73400.0
2020-12-10    72900.0
2020-12-09    73900.0
2020-12-08    71700.0
2020-12-07    72900.0
dtype: float32

In [127]:
s.product()

2.0668773e+24

In [128]:
data = [1, 2, 3, 4, np.nan]
s = Series(data=data)
s

0    1.0
1    2.0
2    3.0
3    4.0
4    NaN
dtype: float64

In [130]:
s.isna()

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [133]:
sum(s.isna())
s.isna().sum()

1

In [135]:
s.notna().sum()

4

In [138]:
len(s)-s.notna().sum()

1

In [158]:
data = ["100,000", "200,000", "300,000"]
index = ["철수", "영희", "아름"]
s = Series(data, index)
s

철수    100,000
영희    200,000
아름    300,000
dtype: object

In [159]:
s.str.replace(",","")
#시리즈.str.문자열함수()

철수    100000
영희    200000
아름    300000
dtype: object

In [160]:
#s.apply(lambda x:int(x.replace(",",""))+100000)
s.map(lambda x : x.replace(",","")).astype('int')

철수    100000
영희    200000
아름    300000
dtype: int32

In [151]:
#"hello".replace("h","a")
int("100,000".replace(",",""))+100000

200000

In [145]:
s

철수    100,000
영희    200,000
아름    300,000
dtype: object

In [144]:
s.astype('int')

ValueError: invalid literal for int() with base 10: '100,000'

In [172]:
s = pd.Series([1, 2, 3], index=['2023-01-01', '2023-01-02', '2023-01-03'])
s

2023-01-01    1
2023-01-02    2
2023-01-03    3
dtype: int64

In [173]:
#01-01    1
#01-02    2
#01-03    3

In [174]:
s.index=s.index.str[5:]
#list(s.index.str[5:])

['', '', '']

In [169]:
s.index=s.index.str.replace('2023-','')
s

01-01    1
01-02    2
01-03    3
dtype: int64

In [170]:
s.index = [s.index.str.replace("2023-","")]

In [171]:
s

01-01    1
01-02    2
01-03    3
dtype: int64

In [ ]:
"""

타이타닉 -> 이름 -> 모든 호칭(Mr., Mrs., Miss., ...) 추출

"""